app/controllers/invoices_controller.rb

SELECT "invoices".* FROM "invoices"
---
    def index
        @invoices = Invoice.all

SELECT "invoices".* FROM "invoices" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
    def show
        @invoice = Invoice.find_by(params[:id])