app/controllers/projects_controller.rb

INSERT INTO "projects" ("adress", "date", "size", "video", "drone", "photo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "projects" ("adress", "date", "size", "video", "drone", "photo", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @project = Project.create(project_params)
        if @project.save