app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (6) LIMIT ?  [["LIMIT", 1]]
---
    def index
        @users = User.all

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test"], ["email", "test@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-12-14 08:45:49.505427"], ["updated_at", "2023-12-14 08:45:49.505427"]]
---
    def create
        @user = User.new(params.require(:user).permit(:name, :email, :password, :password_confirmation))
        if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "denslwashington"], ["password_digest", "[FILTERED]"], ["updated_at", "2023-12-14 10:09:17.046229"], ["id", 5]]
---
    def update
        @user = User.find(params[:id])
        @user.update(params.require(:user).permit(:name, :email, :password, :password_confirmation))